[
    {
        "title": "EspHome: Crea tus inventos inteligentes sin programar",
        "author": "Miguel Ángel López Vicente",
        "date": "05-02-2025 18:00",
        "desc": "Gracias a ESP32 y ESPHome podrás crear dispositivos IoT sin necesidad de programar. Conecta un par de cables y tendrás tus propios sensores que podrás integrar con Home Assistant o cualquier sistema con MQTT.",
        "img": "/img/miguelangel.jpeg",
        "bio": "Programador Backend aficionado al cacharreo y los vídeos juegos cuya meta es automatizar todo, tenga o no sentido hacerlo."
    },
    {
        "title": "Taller de análisis de ransomware",
        "author": "Jose Antonio Álvarez Bermejo",
        "date": "06-02-2025 16:45",
        "desc": "Taller de análisis de ransomware",
        "bio": "Profesor de la Universidad de Almería"
    },
    {
        "title": "Técnicas de análisis de ransomware",
        "author": "Jose Antonio Álvarez Bermejo",
        "date": "06-02-2025 9:15",
        "desc": "Charla sobre técnicas de análisis de ransomware",
        "bio": "Profesor de la Universidad de Almería"
    },
    {
        "title": "Formación Dual a través de Erasmus",
        "author": "Federico Martínez Pérez",
        "date": "05-02-2025 18:45",
        "desc": "Charla Informativa sobre internacionalización (programas de movilidad, becas Erasmus, convalidaciones,etc.)",
        "bio": "Profesor del IES Al-Andalus"
    },
    {
        "title": "El nacimiento de una Arquitectura",
        "author": "Carlos Santisteban",
        "date": "05-02-2025 20:30",
        "desc": "Cómo se diseña una plataforma informática desde 0, tomando como hilo conductor el retro-ordenador Durango.",
        "img": "/img/carlos.png",
        "bio": "Profesor de Informática, 54 años, usuario de ordenadores (ZX Spectrum) desde 1983. Aficionado al retro-computing y artífice de la plataforma Durango."
    },
    {
        "title": " IA Generativa, la vitamina del sector IT y mucho más",
        "author": "César Rodríguez González, Miguel Moya Morales y German Najar Delgado",
        "date": "05-02-2025 17:15",
        "desc": "Contenido: <ol class=\"list-decimal list-inside\"><li>Que es la IA Generativa.</li><li>Modelos Fundacionales.</li><li>Como los entrenamos.</li><li>Como funciona el RAG.</li><li>Prompting.</li><li>Problemas.</li><li>Recomendaciones.</li></ol>",
        "img": "/img/CesarRodriguezGonzalez.png",
        "img2": "/img/MiguelMoyaMorales.png",
        "img3": "/img/GermanNajarDelgado.jpeg",
        "bio3": "German Najar Delgado es Técnico superior Desarrollo Multiplataforma por el instituto IES Al-Ándalus, Trabajando en Viewnext desde Julio de 2024 aunque previamente ya estaba vinculado con la empresa por sus prácticas. Actualmente desarrollador de automatizaciones. Certificado en Watson X",
        "bio2": "Miguel Moya Morales es Ingeniero Industrial Superior por la Universidad de Málaga. Trabajando en Viewnext desde junio de 2016. Actualmente Scrum Master/Project Manager de NextAI - Proyecto de IA Gen de Viewnext. PeM (People Manager) de la práctica de IA & Analytics. Actual Talent Ambassador de Viewnext en Almería.",
        "bio": "César Rodríguez González es Téc. Sup. Desarrollo de APP WEB. Empleado de Viewnext desde julio del 2024 aunque previamente ya estaba vinculado con la empresa por sus prácticas. IA Developer. Certificado en Watson X."
    },
    {
        "title": "Marea azul infinita",
        "author": "Miryam Navarrete Ramos, José Antonio Moreno Galdeano y Francisco Navarro De Juan",
        "date": "06-02-2025 20:15",
        "img": "/img/logohiberus.png",
        "desc": "Durante esta charla explicaremos la trayectoria profesional desde unas prácticas curriculares desde FP superior hasta la actualidad hasta la consolidación de nuestra carrera profesional-personal dentro de hiberus.",
        "bio": " Miryam Navarrete Ramos (HRBP), José Antonio Moreno Galdeano (Técnico de sistemas) y Francisco Navarro De Juan (Desarrollador FullStack)"
    },
    {
        "title": "Back to the Future: FP Edition",
        "author": "Adrián Alonso y Ruben Sánchez",
        "date": "05-02-2025 19:45",
        "img": "/img/ruben.jpeg",
        "img2": "/img/adrian.jpeg",
        "desc": "¿Sabes qué te encontrarás al dar el salto al mercado laboral? En esta charla motivacional e interactiva, exploraremos todo lo que necesitas saber para afrontar con confianza tus primeros pasos en el sector tech. Hablaremos desde cómo preparar tu primera entrevista hasta entender las expectativas salariales, seguiremos con los stacks tecnológicos más demandados y las diferentes trayectorias profesionales que podrás seguir. Además, hablaremos de otros temas importantes en el día a día de nuestras posiciones, la importancia de las soft skills, el impacto de los equipos bien estructurados y el valor de participar en comunidades tecnológicas. ¡Prepárate para descubrir cómo empezar con buen pie tu carrera en tecnología!",
        "bio2": "Adrián Alonso (Engineering Manager en Volkswagen Digital:Hub) profesional con amplia experiencia en el sector y junto a Rubén son organizadores de AlmeriaTech, una comunidad tecnológica activa en la ciudad, se dedican a impulsar el aprendizaje y la colaboración a través de eventos y charlas mensuales.",
        "bio": "Rubén Sánchez (Frontend Technical Lead en Ayesa.) Profesional con amplia experiencia en el sector tecnológico y apasionados por compartir conocimiento. "
    },
    {
        "title": "Programando con IA generativa",
        "author": "César Rodríguez González, Miguel Moya Morales y German Najar Delgado",
        "date": "06-02-2025 17:45",
        "desc": "Contenido:<ol class=\"list-decimal list-inside\"><li>Planteamos una idea.</li><li>Generación de prompts</li><li> Generación y ejecución de código</li></ol>",
        "img": "/img/CesarRodriguezGonzalez.png",
        "img2": "/img/MiguelMoyaMorales.png",
        "img3": "/img/GermanNajarDelgado.jpeg",
        "bio3": "German Najar Delgado es Técnico superior Desarrollo Multiplataforma por el instituto IES Al-Ándalus, Trabajando en Viewnext desde Julio de 2024 aunque previamente ya estaba vinculado con la empresa por sus prácticas. Actualmente desarrollador de automatizaciones. Certificado en Watson X",
        "bio2": "Miguel Moya Morales es Ingeniero Industrial Superior por la Universidad de Málaga. Trabajando en Viewnext desde junio de 2016. Actualmente Scrum Master/Project Manager de NextAI - Proyecto de IA Gen de Viewnext. PeM (People Manager) de la práctica de IA & Analytics. Actual Talent Ambassador de Viewnext en Almería.",
        "bio": "César Rodríguez González es Téc. Sup. Desarrollo de APP WEB. Empleado de Viewnext desde julio del 2024 aunque previamente ya estaba vinculado con la empresa por sus prácticas. IA Developer. Certificado en Watson X."
    },
    {
        "title": "Taller UnitForce",
        "author": "UnitForce",
        "date": "06-02-2025 19:15",
        "desc": "Taller Tecnologia de la empresa UnitForce",
        "bio": "UnitForce"
    },
    {
        "title": "Uso de Microcontroladores ESP32 con sensores",
        "author": "Raúl Rio",
        "date": "06-02-2025 12:30",
        "desc": "Charla acerca del uso de Microcontroladores ESP32 con sensores y su conexión con Angular.",
        "bio": "Anitugo alumno del IES Al-Andalus y trabajador de IkosTech"
    },{
        "title": "¿Es posible trabajar en lo que me gusta?",
        "author": "Joaquín de la Casa",
        "date": "06-02-2025 12:30",
        "desc": "Abordaremos las distintas formas de conseguir el trabajo de nuestros sueños y el difícil camino que hay que hacer hasta lograrlo.",
        "img": "/img/joaquinarcade.jpeg",
        "bio": "Organizador de Eventos en Arcade Bits. Coleccionista de Videojuegos Retro. Colaborador en InterAlmería, Candil Radio y Radio Ejido."
    },
    {
        "title": "Taller de Frontend con IA",
        "author": "Mario Borbalás Checa",
        "date": "06-02-2025 19:15",
        "img": "/img/FotoMario.jpeg",
        "desc": "Taller de Frontend con IA",
        "bio": "Soy Ingeniero Superior en Informática por la Universidad de Almería. Comencé mi carrera como Programador Junior y más tarde Senior en Clave Informática en Almería, donde trabajé desde 2003 hasta 2007 en el desarrollo de un ERP Agroalimentario. Luego, fui contratado por Getronics(Tecnocom) en Almería como Programador Senior, donde estuve desde 2007 hasta 2011 desarrollando un ERP Agricola (ERP Agro) en Hispatec. Desde 2011, trabajo en Unit4 en Granada (en remoto desde 2019), donde he desempeñado varios cargos de perfil técnico, desde Standard Engineer a Lead Architect. A lo largo de mi carrera, he adquirido una amplia experiencia en programación y arquitectura, y he trabajado en proyectos de gran envergadura tales como la migracion del ERP de Unit4 a la nube o la adopcion de Microfrontends como solucion multiplataforma escalable en el Frontend."
    },
    {
        "title": "Ejercicio Red Team sobre Cajeros Automaticos",
        "author": "Francisco González López",
        "date": "06-02-2025 10:15",
        "desc": "Demostración de que se puede hacer en un cajero automatico.",
        "bio": "</p><p>Francisco es experto en auditoría y seguridad de infraestructuras financieras críticas, especialmente en el sector bancario. Ha trabajado extensamente con grandes sistemas como IBM Mainframes, centrándose en los retos de seguridad menos comunes pero vitales para las operaciones a gran escala. Sus profundos conocimientos en estas áreas le han posicionado como un asesor de confianza para organizaciones que dependen tanto de sistemas heredados como de tecnologías de vanguardia.</p><p>Además de su labor profesional, Francisco ha compartido sus conocimientos a través de la docencia en prestigiosas instituciones como la Universidad Autónoma de Madrid y la Universidad Complutense, donde ha colaborado en diversos programas de máster. También ha dirigido cursos de formación especializada para cuerpos de seguridad nacionales e internacionales, centrados en las últimas técnicas ofensivas y defensivas en ciberseguridad.</p><p>A lo largo de su carrera, Francisco ha contribuido al avance de este campo mediante la publicación de artículos en revistas especializadas en ciberseguridad y la presentación de ponencias en conferencias, donde ha introducido estrategias innovadoras de ataque y defensa. Su participación en el desarrollo de sistemas de seguridad móvil desde las primeras fases de la tecnología demuestra aún más su capacidad para adaptarse a las amenazas y tecnologías emergentes.</p><p>La trayectoria profesional de Francisco ha incluido puestos clave en destacadas organizaciones como SERMEPA (ahora Redsys), Bankinter, Banco Santander y consultoras líderes como InnotecSystem, Accenture, donde su liderazgo y perspicacia técnica han impulsado importantes avances en seguridad.</p><p>"
    }
]