[
    {
        "title": "EspHome: Crea tus inventos inteligentes sin programar",
        "author": "Miguel Ángel López Vicente",
        "date": "06-02-2025 16:45",
        "desc": "Gracias a ESP32 y ESPHome podrás crear dispositivos IoT sin necesidad de programar. Conecta un par de cables y tendrás tus propios sensores que podrás integrar con Home Assistant o cualquier sistema con MQTT.",
        "img": "/img/miguelangel.jpeg",
        "bio": "Programador Backend aficionado al cacharreo y los vídeos juegos cuya meta es automatizar todo, tenga o no sentido hacerlo."
    },
    {
        "title": "Taller TPM",
        "author": "Jose Antonio Álvarez Bermejo",
        "date": "06-02-2025 09:15",
        "desc": "Taller de TPM",
        "bio": "Profesor de la Universidad de Almería"
    },
    {
        "title": "Charla Ciberseguridad",
        "author": "Jose Antonio Álvarez Bermejo",
        "date": "06-02-2025 17:30",
        "desc": "Charla sobre Ciberseguridad",
        "bio": "Profesor de la Universidad de Almería"
    },
    {
        "title": "Formación Dual a través de Erasmus",
        "author": "Federico Martínez Pérez",
        "date": "05-02-2025 18:45",
        "desc": "Charla Informativa sobre internacionalización (programas de movilidad, becas Erasmus, convalidaciones,etc.)",
        "bio": "Profesor del IES Al-Andalus"
    },
    {
        "title": "El nacimiento de una Arquitectura",
        "author": "Carlos Santisteban",
        "date": "05-02-2025 19:45",
        "desc": "Cómo se diseña una plataforma informática desde 0, tomando como hilo conductor el retro-ordenador Durango.",
        "img": "/img/carlos.png",
        "bio": "Profesor de Informática, 54 años, usuario de ordenadores (ZX Spectrum) desde 1983. Aficionado al retro-computing y artífice de la plataforma Durango."
    },
    {
        "title": "Charla Tecnología",
        "author": "ViewNext",
        "date": "05-02-2025 17:15",
        "desc": "Charla sobre Tecnología por la empresa del sector ViewNext",
        "bio": "Viewnext"
    },
    {
        "title": "Charla Tecnología",
        "author": "Hiberus",
        "date": "05-02-2025 18:00",
        "desc": "Charla sobre Tecnología por la empresa del sector Hiberus",
        "bio": "Hiberus"
    },
    {
        "title": "Back to the Future: FP Edition",
        "author": "Adrián Alonso y Ruben Sánchez",
        "date": "06-02-2025 18:45",
        "img": "/img/ruben.jpeg",
        "img2": "/img/adrian.jpeg",
        "desc": "¿Sabes qué te encontrarás al dar el salto al mercado laboral? En esta charla motivacional e interactiva, exploraremos todo lo que necesitas saber para afrontar con confianza tus primeros pasos en el sector tech. Hablaremos desde cómo preparar tu primera entrevista hasta entender las expectativas salariales, seguiremos con los stacks tecnológicos más demandados y las diferentes trayectorias profesionales que podrás seguir. Además, hablaremos de otros temas importantes en el día a día de nuestras posiciones, la importancia de las soft skills, el impacto de los equipos bien estructurados y el valor de participar en comunidades tecnológicas. ¡Prepárate para descubrir cómo empezar con buen pie tu carrera en tecnología!",
        "bio2": "Adrián Alonso (Engineering Manager en Volkswagen Digital:Hub) profesional con amplia experiencia en el sector y junto a Rubén son organizadores de AlmeriaTech, una comunidad tecnológica activa en la ciudad, se dedican a impulsar el aprendizaje y la colaboración a través de eventos y charlas mensuales.",
        "bio": "Rubén Sánchez (Frontend Technical Lead en Ayesa.) Profesional con amplia experiencia en el sector tecnológico y apasionados por compartir conocimiento. "
    },
    {
        "title": "Taller Práctico de IA",
        "author": "ViewNext",
        "date": "06-02-2025 11:30",
        "desc": "Taller práctico de IA",
        "bio": "Viewnext"
    },
    {
        "title": "Taller UnitForce",
        "author": "UnitForce",
        "date": "06-02-2025 12:30",
        "desc": "Taller Tecnologia de la empresa UnitForce",
        "bio": "UnitForce"
    },
    {
        "title": "Charla IkosTech",
        "author": "IkosTech",
        "date": "06-02-2025 19:45",
        "desc": "Charla sobre IkosTech",
        "bio": "IkosTech"
    }
]