[
    {
        "id": 1,
        "name": "Viewnext - IA Generativa, la vitamina del sector IT y mucho más",
        "date": "4 de Febrero de 2026",
        "hour": "17:00-17:45",
        "description": "Contenido: <ol class='list-decimal list-inside'><li>Que es la IA Generativa.</li><li>Modelos Fundacionales.</li><li>Como los entrenamos.</li><li>Como funciona el RAG.</li><li>Prompting.</li><li>Problemas.</li><li>Recomendaciones.</li></ol>",
        "authors": [
            {
                "name": "ALEJANDRO PARDO VIDAÑA",
                "charge": "Desarrollador IA",
                "bio": "Me llamo Alejandro y actualmente estoy en Viewnext en la práctica de Inteligencia Artificial Generativa. Yo vengo de hacer estudios relacionados con la informatica como FP media y luego Ingeniería Informática en Almería. En mi día a día utilizo la IA como una herramienta para aumentar la productividad y el conocimiento, igual que antes se usaba Stack Overflow, pero adaptado a las tecnologías actuales. Soy una persona normal a la que le interesa cómo la IA puede ayudarnos a aprender y trabajar mejor en informática.",
                "picture": "/img/AlejandroPardo.jpg"
            },
            {
                "name": "JUAN LOPERA SANCHEZ",
                "charge": "Desarrollador IA",
                "bio": "Me llamo Juan y actualmente estoy en Viewnext en la práctica de Inteligencia Artificial Generativa. Desde siempre he tenido interés por la informática, lo que me llevó a estudiar el grado medio en Sistemas Microinformáticos y Redes (SMR) y posteriormente el grado superior en Desarrollo de Aplicaciones Web (DAW). En mi día a día utilizo la inteligencia artificial para hacer mi trabajo más eficiente y seguir aprendiendo, aprovechando las herramientas y tecnologías disponibles en la actualidad. También la incorporo en las soluciones que desarrollo, para que otras personas puedan beneficiarse de sus ventajas y descubrir nuevas formas de trabajar.",
                "picture": "/img/JuanLopera.jpg"
            }
        ]
    },
    {
        "id": 2,
        "name": "Miguel Ángel López Vicente - Slidev: No hagas diapositivas, prográmalas",
        "date": "4 de Febrero de 2026",
        "hour": "17:45-18:30",
        "description": "Slidev es una herramienta que nos permitirá crear diapositivas para nuestras programaciones mediante programación  haciendo uso de Markdown y HTML.",
        "authors": [
            {
                "name": "Miguel Ángel López Vicente",
                "charge": "Programador Backend para Inditex",
                "bio": "Programador backend aficionado al cacharreo, videojuegos, domótica y cosas frikis en general.",
                "picture": "/img/miguelangel.jpeg"
            }
        ]
    },
    {
        "id": 3,
        "name": "Formación Dual a través de Erasmus",
        "date": "4 de Febrero de 2026",
        "hour": "18:30 - 19:15",
        "description": "Charla formativa sobre la formación dual mediante el programa Erasmus, enfocada en las oportunidades que ofrece a los estudiantes para adquirir experiencia práctica en empresas europeas mientras continúan su educación académica.",
        "authors": [
            {
                "name": "Federico Martínez",
                "charge": "Profesor del IES Al-Andalus",
                "bio": "Federico Martínez es un profesor del IES Al-Andalus encargado de la formación Erasmus."
            }
        ]
    },
    {
        "id": 4,
        "name": "Charlas Ráidas",
        "date": "4 de Febrero de 2026",
        "hour": "19:15 - 19:30",
        "description": "Charlas rápidas impartidas por los alumnos del IES Al-Andalus de la modadalida de Formación Profesional.",
        "authors": [
            {
                "name": "Alumno 1",
                "charge": "Alumno de DAM",
                "bio": "Alumno del IES Al-Andalus de la modalidad semipresencial de Desarrollo de Aplicaciones Multiplataforma."
            },
            {
                "name": "Alumno 2",
                "charge": "Alumno de DAW",
                "bio": "Alumno del IES Al-Andalus de la modalidad semipresencial de Desarrollo de Aplicaciones Web."
            },
            {
                "name": "Alumno 3",
                "charge": "Alumno de ASIR",
                "bio": "Alumno del IES Al-Andalus de la modalidad semipresencial de Administración de Sistemas Informáticos en Red."
            }
        ]
    },
    {
        "id": 5,
        "name": "Adrián Alonso (Almería Tech) - Code your Cloud: el futuro de la Infraestructura como Código impulsada por IA",
        "date": "4 de Febrero de 2026",
        "hour": "19:30 - 20:15",
        "description": "La forma en la que gestionamos infraestructura ha evolucionado radicalmente en los últimos años. En esta charla haremos un recorrido por esa evolución: desde el clickops y la gestión manual, pasando por la automatización clásica y la Infraestructura como Código (IaC), hasta llegar a los enfoques actuales apoyados en Inteligencia Artificial. Veremos cómo la IA está cambiando la forma de definir, validar, desplegar y operar infraestructuras en la nube, y qué oportunidades (y retos) abre para los equipos técnicos de hoy y del futuro.",
        "authors": [
            {
                "name": "Adrián Alonso",
                "charge": "Software Engineer en Plain Concepts/Cofounder de AlmeríaTech",
                "bio": "Ingeniero de software con experiencia en distintos ámbitos del desarrollo y la arquitectura cloud. Aprendiz constante y divulgador por vocación, combina su trabajo profesional con la creación de comunidad tecnológica a través de AlmeríaTech. Le apasiona explorar nuevas formas de construir software y compartir conocimiento de manera práctica y accesible.",
                "picture": "/img/adrian.jpeg"
            }
        ]
    },
    {
        "id": 6,
        "name": "Carlos Santisteban (La Jaquería) - Cómo montárselo en épocas de carestía de recursos",
        "date": "4 de Febrero de 2026",
        "hour": "20:15 - 21:00",
        "description": "Los formidables avances de la informática nos proporcionan tal potencia de proceso que nos despreocupamos de optimizar el uso de recursos... pero no siempre ha sido así. Bajo el hilo conductor del proyecto Durango (un ordenador de 8 bits del siglo XXI) podemos hurgar en las necesidades de un dispositivo limitado para sacarle el máximo rendimiento.",
        "authors": [
            {
                "name": "Carlos Santisteban",
                "charge": "Profesor del IES Bahía de Almería",
                "bio": "Profesor de Informática, 55 años, usuario de ordenadores (ZX Spectrum) desde 1983. Aficionado al retro-computing y artífice de la plataforma Durango. ",
                "picture": "/img/carlos.png"
            }
        ]
    },
    {
        "id": 10,
        "name": "Jose Antonio Álvarez Bermejo - Inteligencia, defensa y supercomputación",
        "date": "5 de Febrero de 2026",
        "hour": "9:30 - 10:15",
        "description": "El perfil de analista de información es crucial en la época en la que vivimos. Si además, nos centramos en el campo de la ciberdefensa, toma aún má relevancia. En esta charla vamos a tratar el tema del perfil de analista de inteligencia y del impacto que tiene no tener bajo control a las potenciales amenazas, desde el entorno personal, empresarial, hasta el nivel de entorno nacional.",
        "authors": [
            {
                "name": "Jose Antonio Álvarez Bermejo",
                "charge": "Profesor de la Universidad de Almería",
                "bio": "Profesor de la universidad de Almería con amplia experiencia en ciberdefensa."
            }
        ]
    },
    {
        "id": 7,
        "name": "Jesús Marín - Construyendo una estrategia de seguridad y cumplimiento en AWS",
        "date": "5 de Febrero de 2026",
        "hour": "10:15 - 11:00",
        "description": " La importancia de las plataformas de nube pública es bien conocida, pero existe un importante desconocimiento sobre los riesgos de seguridad que puede suponer y los métodos para abordarlos. En esta charla se introducirán las principales iniciativas en cuestión de seguridad y cumplimiento normativo en Amazon Web Services, y se expondrán las principales herramientas y buenas prácticas para crear una estrategia de seguridad sólida al mismo tiempo que ágil. Todo desde un enfoque conceptual, pudiendo ser trasladado a otras plataformas de nube pública.",
        "authors": [
            {
                "name": "Jesús Marín",
                "charge": " AWS Solutions Specialist @ Ingram Micro",
                "bio": " Estudió en la Universidad de Almería, y tras varios años enfocado en ciberseguridad hoy día se dedica a la construcción de soluciones en nube pública.",
                "picture": "/img/jesus.jpg"
            }
        ]
    },
    {
        "id": 8,
        "name": "IOBuilders - Construyendo el futuro: DLT, IA y el camino real de un desarrollador junior",
        "date": "5 de Febrero de 2026",
        "hour": "11:30 - 12:15",
        "description": "Una charla desde la experiencia de un CTO sobre cómo las tecnologías DLT están transformando sectores clave y qué oportunidades reales existen para los desarrolladores junior. Hablaremos de cómo orientar una carrera profesional en tecnología, del papel de la inteligencia artificial como aliada del programador y de por qué los perfiles junior tienen hoy más oportunidades que nunca en empresas como ioBuilders.",
        "authors": [
            {
                "name": "Ivan Saiz",
                "charge": "CTO en IOBuilders",
                "bio": "CTO con más de 9 años de experiencia en el sector blockchain, especializado en el diseño y desarrollo de soluciones empresariales y aplicaciones descentralizadas. Apasionado del emprendimiento, el desarrollo de software y el diseño de arquitecturas tecnológicas, cuenta con una amplia experiencia en la tokenización de activos digitales. A lo largo de su trayectoria ha trabajado con diferentes tipos de activos, incluyendo NFTs, monedas digitales, bonos, acciones, fondos y activos inmobiliarios.",
                "picture": "/img/Ivan.jpeg"
            }
        ]
    },
    {
        "id": 9,
        "name": "Enrique Fernández - Charla",
        "date": "5 de Febrero de 2026",
        "hour": "12:15 - 13:00",
        "description": "Charla impartida por Enrique Fernández sobre temas relevantes en el ámbito de la tecnología y la educación.",
        "authors": [
            {
                "name": "Enrique Fernández",
                "charge": "Profesor del IES Al-Andalus",
                "bio": "Enrique Fernández es profesor del IES Al-Andalus con amplia experiencia en formación tecnológica."
            }
        ]
    },
    {
        "id": 11,
        "name": "Carlos Barbero-Cortés - Introducción a la globalización e internacionalización",
        "date": "5 de Febrero de 2026",
        "hour": "16:30 - 17:15",
        "description": "Charla sobre temas relevantes en el ámbito de la tecnología impartida por profesionales de AirBnb.",
        "authors": [
            {
                "name": "Carlos Barbero-Cortés",
                "charge": "Localization Program Manager en Airbnb - GILT Ninja",
                "bio": "Desarrollador en AirBnb"
            }
        ]
    },
    {
        "id": 12,
        "name": "Miguel Ángel Rosa Caparros - Introducción práctica a Linux y Ciberseguridad con OverTheWire – Bandit",
        "date": "5 de Febrero de 2026",
        "hour": "17:15 - 18:15",
        "description": "<p>En este taller se introducirá a los asistentes en el uso de Linux y los fundamentos de la ciberseguridad mediante Bandit, uno de los wargames educativos más conocidos de la plataforma OverTheWire.</p> <p>A lo largo de la sesión se trabajará en un entorno real accesible por SSH, donde los participantes deberán resolver una serie de retos progresivos utilizando comandos básicos de Linux.</p> <p>El objetivo del taller no es “hackear”, sino aprender a pensar técnicamente, interpretar problemas reales y adquirir soltura en el uso de Linux. El taller está orientado a estudiantes y personas con conocimientos básicos de informática, sin necesidad de experiencia previa en seguridad.</p>",
            
        "authors": [{
                "name": "Miguel Ángel Rosa Caparros",
                "charge": "Administrador de Sistemas",
                "bio": "Miguel Ángel Rosa Caparrós es Administrador de Sistemas Informáticos, con formación especializada en Linux, redes, servicios de red y ciberseguridad. Cuenta con experiencia práctica en la implantación, configuración y securización de infraestructuras, así como en entornos de virtualización y contenedores Docker.",
                "picture": "/img/miguelangelrosa.jpeg"
            }
        ]
    },
    {
        "id": 13,
        "name": "ViewNext - Programando con IA generativaller",
        "date": "5 de Febrero de 2026",
        "hour": "18:15 - 19:15",
        "description": "Contenido:<ol><li>1.       Planteamos una idea.</li><li>2.       Generación de prompts</li><li>3.       Generación y ejecución de código</li></ol>",
        "authors": [
            {
                "name": "ALEJANDRO PARDO VIDAÑA",
                "charge": "Desarrollador IA",
                "bio": "Me llamo Alejandro y actualmente estoy en Viewnext en la práctica de Inteligencia Artificial Generativa. Yo vengo de hacer estudios relacionados con la informatica como FP media y luego Ingeniería Informática en Almería. En mi día a día utilizo la IA como una herramienta para aumentar la productividad y el conocimiento, igual que antes se usaba Stack Overflow, pero adaptado a las tecnologías actuales. Soy una persona normal a la que le interesa cómo la IA puede ayudarnos a aprender y trabajar mejor en informática.",
                "picture": "/img/AlejandroPardo.jpg"
            },
            {
                "name": "JUAN LOPERA SANCHEZ",
                "charge": "Desarrollador IA",
                "bio": "Me llamo Juan y actualmente estoy en Viewnext en la práctica de Inteligencia Artificial Generativa. Desde siempre he tenido interés por la informática, lo que me llevó a estudiar el grado medio en Sistemas Microinformáticos y Redes (SMR) y posteriormente el grado superior en Desarrollo de Aplicaciones Web (DAW). En mi día a día utilizo la inteligencia artificial para hacer mi trabajo más eficiente y seguir aprendiendo, aprovechando las herramientas y tecnologías disponibles en la actualidad. También la incorporo en las soluciones que desarrollo, para que otras personas puedan beneficiarse de sus ventajas y descubrir nuevas formas de trabajar.",
                "picture": "/img/JuanLopera.jpg"
            }
        ]
    },
    {
        "id": 14,
        "name": "Patricio García Avendaño - Entendiendo el ransomware a través de la ingeniería inversa",
        "date": "5 de Febrero de 2026",
        "hour": "19:30 - 20:30",
        "description": "En este taller realizaremos un proceso de ingeniería inversa a un ransomware, el cual ha sido utilizado para encriptar nuestros datos. Haciendo uso de herramientas de ingeniería inversa nos pondremos en el papel de un analista de malware para intentar descubrir como nos han encriptado todos los archivos, y realizando un análisis estático vamos a intentar descubrir si el ciberdelincuente ha cometido algún error que nos permita recuperar nuestros archivos sin tener que pagar. Es un taller de iniciación al análisis de malware, por lo cual no se requiere experiencia previa, sólo ganas y motivación para aprender.",
        "authors": [
            {
                "name": "Patricio García Avendaño",
                "charge": "Becario de investigación en la UAL.",
                "bio": "Becario de investigación en la Universidad de Almería en el departamento de matemática computacional y ciberseguridad, bajo la supervisión de José Antonio Álvarez Bermejo. Apasionado de la ciberseguridad y el análisis de malware.",
                "picture": "/img/patricio.jpeg"
            }
        ]
    },
    {
        "id": 15,
        "name": "Hiberus - De la Vida al Modelo",
        "date": "5 de Febrero de 2026",
        "hour": "20:30 - 21:30",
        "description": "Los 10 primeros minutos hablaremos sobre hiberus para que los alumnos/as puedan conocer la empresa y a qué nos dedicamos. A continuación, Francisco y Mari Carmen compartirán su experiencia desde el módulo hasta hoy y, por último, la descripción del taller: En este taller haremos una introducción rápida y práctica a los Agentes de Inteligencia Artificial en terminal (CLI) y a la metodología Spec-Driven Development (SDD), viendo cómo estas herramientas pueden ayudarnos a automatizar tareas, generar, mejorar código y trabajar de forma más ordenada a partir de una especificación clara. A través de un ejemplo sencillo, aprenderemos a definir una spec mínima y utilizar la IA como apoyo para acelerar el desarrollo sin perder control ni calidad.",
        "authors": [
            {
                "name": "Pilar Menéndez Fernández",
                "charge": "Empleada de Hiberus Tecnología",
                "bio": "Profesional responsable de la selección de talento en la delegación de Hiberus Almería, especializada en perfiles tecnológicos. Enfocada en identificar el mejor encaje entre personas y proyectos para impulsar el crecimiento del equipo."
            },
            {
                "name": "Francisco Navarro De Juan",
                "charge": "Empleado de Hiberus Tecnología",
                "bio": "Apasionado desde pequeño al mundo de la tecnología y la informática, actualmente soy desarrollador full-stack en hiberus, hago un uso diario de herramientas con IA para aplicarlas para el día a día para optimizar procesos diarios."
            },
            {
                "name": "María del Carmen Fernández Sánchez",
                "charge": "Empleada de Hiberus Tecnología",
                "bio": "Desarrolladora full-stack en Xalok, con especialización en backend, dedicada a la creación de soluciones para medios digitales como periódicos y medios de comunicación, donde la inteligencia artificial es una parte importante del día a día."
            },
            {
                "name": "Alejandro Roca López",
                "charge": "Empleado de Hiberus Tecnología",
                "bio": "Profesional del ámbito de la informática y la tecnología, con interés en el uso práctico de la Inteligencia Artificial aplicada a tareas reales del día a día. En mis ratos libres me gusta cacharrear y enfrentarme a retos interesantes."
            }
        ]
    },
    {
        "id": 16,
        "name": "Javier Palmero Clares - Manual de supervivencia para el desarrollador Junior en el infierno, también llamado mercado laboral",
        "date": "5 de Febrero de 2026",
        "hour": "12:15 - 13:00",
        "description": " Una charla sobre la realidad laboral actual, más allá de los libros. Hablaremos de habilidades vitales que no siempre están en el temario: comunicación efectiva con compañeros y, lo más importante, qué hacer (y qué no hacer) durante las prácticas para conseguir el contrato. En lo técnico, veremos a qué se enfrenta un Junior hoy en día: desde la creación de algoritmos en Python hasta el gran reto de lidiar con \"código legado\" en entornos reales de producción.",
        "authors": [
            {
                "name": "Javier Palmero Clares",
                "charge": "Apps Developer en GRS GranSolar Group",
                "bio": "Antiguo alumno (aunque no mucho) del IES Al-Ándalus, promoción 2025. Me incorporé al equipo de GranSolar inmediatamente después de terminar las prácticas. Actualmente trabajo combinando el desarrollo de nuevos algoritmos, aplicaciones de escritorio e integración de bases de datos en el sector de las renovables. Ajedrecista en mis ratos libres."
            }
        ]
    }
]